In [136]:
# list of high schools
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]

In [137]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [138]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [139]:
for school in high_school_types:
    print(school)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [140]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [141]:
# Add the Pandas dependency
import pandas as pd

In [142]:
# Create a Pandas Series from a list.
school_series = pd.Series(["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"])
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [143]:
for school in school_series:
    print(school)

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [144]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [145]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [146]:
# Three separate lists of information on high schools
school_id = [0,1,2,3,4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [147]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

# Add the list to a new DataFrame.
schools_df["School ID"] = school_id
schools_df["school_name"] = school_name
schools_df["type_of_school"] = type_of_school

# Print the DataFrame
schools_df

   School ID            school_name type_of_school
0          0      Huang High School       District
1          1   Figueroa High School       District
2          2    Shelton High School        Charter
3          3  Hernandez High School       District
4          4    Griffin High School        Charter

In [148]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

# Convert the high_schools_dict to a DataFrame.
schools_df = pd.DataFrame(high_schools_dict)

# Print the DataFrame.
schools_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [149]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [150]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [151]:
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [152]:
# Skill Drill: create a list for each column and add each list to a new Pandas DataFrame.

# Three separate lists of information on high schools
sd_school_id = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14]

sd_school_name = ["Huang High School", "Figueroa High School",
                 "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School",
                 "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", 
                 "Wright High School", "Rodriguez High School", "Johnson High School", "Ford High School", 
                 "Thomas High School"]

sd_type_of_school = ["District", "District", "Charter", "District","Charter","Charter","Charter","Disrict",
                    "Charter","Charter","Charter","District","District","District","Charter"]

# Initialize a new DataFrame.
sd_schools_df = pd.DataFrame()

# Add the list to a new DataFrame.
sd_schools_df["School ID"] = sd_school_id
sd_schools_df["school_name"] = sd_school_name
sd_schools_df["type_of_school"] = sd_type_of_school

# Print the DataFrame
sd_schools_df

    School ID            school_name type_of_school
0           0      Huang High School       District
1           1   Figueroa High School       District
2           2    Shelton High School        Charter
3           3  Hernandez High School       District
4           4    Griffin High School        Charter
5           5     Wilson High School        Charter
6           6    Cabrera High School        Charter
7           7     Bailey High School        Disrict
8           8     Holden High School        Charter
9           9       Pena High School        Charter
10         10     Wright High School        Charter
11         11  Rodriguez High School       District
12         12    Johnson High School       District
13         13       Ford High School       District
14         14     Thomas High School        Charter

In [153]:
list1 = ["a", "b", "c", "d"]

list2 = [0, 1, 2, 3]

df = pd.DataFrame()

df["Col1"] = list1
df["Col2"] = list2

df

  Col1  Col2
0    a     0
1    b     1
2    c     2
3    d     3

In [154]:
list1 = ["a", "b", "c", "d"]

list2 = [1, 2, 3]

df = pd.DataFrame(list2)

df

   0
0  1
1  2
2  3

In [155]:
myList = ["apple", "banana", "grapes"]

for fruits in myList:
    print(fruits.strip("pan"))

le
b
grapes

In [156]:
fruit = "apple"

fruit.strip("pal")

'e'

In [157]:
sentence = "Hello World"
sentence.replace("l","r")

'Herro Worrd'

In [158]:
sentence = "Hello World"
sentence.replace("el","bh")

'Hbhlo World'

In [174]:
list = ['apple','banana','orange']
list = pd.Series(list)
list.map({"banana":"grape"})

0      NaN
1    grape
2      NaN
dtype: object

In [185]:
col1_list = [1,2,3,4]
col2_list = ['b','a','c','d']
col3_list = [3,2,1,5]
col4_list = ['apple','banana','orange','grape']

left_df = pd.DataFrame()
left_df["col1"] = col1_list
left_df["col2"] = col2_list

right_df = pd.DataFrame()
right_df['col1'] = col3_list
right_df['col3'] = col4_list

df = pd.merge(left_df,right_df,on='col1')

df

   col1 col2    col3
0     1    b  orange
1     2    a  banana
2     3    c   apple

In [199]:
df = df[['col2','col1','col3']]
df

  col2  col1    col3
0    b     1  orange
1    a     2  banana
2    c     3   apple

In [200]:
df.describe()

       col1
count   3.0
mean    2.0
std     1.0
min     1.0
25%     1.5
50%     2.0
75%     2.5
max     3.0

In [187]:
df.shape[0]

3

In [196]:
df.set_index(["col3"])

        col1 col2
col3
orange     1    b
banana     2    a
apple      3    c

In [113]:
pd.merge(left_df,right_df,on='col1',how="left")

   col1 col2    col3
0     1    b  orange
1     2    a  banana
2     3    c   apple
3     4    d     NaN

In [114]:
pd.merge(left_df,right_df,on='col1',how="right")

   col1 col2    col3
0     3    c   apple
1     2    a  banana
2     1    b  orange
3     5  NaN   grape

In [178]:
num = 9000
"${:,.1f}".format(num)

'$9,000.0'

In [183]:
df = pd.DataFrame()

df["fruit"] = ""
df["vegetables"] = ""

df.rename(columns = {"vegetables": "Vegetables"})

Empty DataFrame
Columns: [fruit, Vegetables]
Index: []